/**
 * Created by 懒牛牛 on 2017/2/14.
 */
// Boolean 运算符有三种：NOT、AND 和 OR。
// ToBoolean 操作

// 逻辑 NOT 运算符
// 逻辑 AND 运算符
// 逻辑 OR 运算符

// 乘法运算符由星号（*）表示，用于两数相乘。
// 除法运算符由斜杠（/）表示，用第二个运算数除第一个运算数：
// 除法（余数）运算符由百分号（%）表示，
// 法运算符由加号（+）表示：
// 减法运算符（-），

// 关系运算符小于、大于、小于等于和大于等于执行的是两个数的比较运算，比较方式与算术比较运算相同。

// 比较数字和字符串
// 另一种棘手的状况发生在比较两个字符串形式的数字时，比较首字符

// ECMAScript 提供了两套等性运算符：等号和非等号用于处理原始值，全等号和非全等号用于处理对象。

// 条件运算符是 ECMAScript 中功能最多的运算符 多元运算符 且可以嵌套

// 赋值运算符
// 简单的赋值运算符由等号（=）实现，只是把等号右边的值赋予等号左边的变量。
// 乘法/赋值（*=）
// 除法/赋值（/=）
// 取模/赋值（%=）
// 加法/赋值（+=）
// 减法/赋值（-=）
// 左移/赋值（<<=）
// 有符号右移/赋值（>>=）
// 无符号右移/赋值（>>>=）

// 用逗号运算符可以在一条语句中执行多个运算。










