/**
 * Created by 懒牛牛 on 2017/2/16.
 */

/*
操作符
算数操作符
位操作符
关系操作符
相等操作符
 */

/*
一元操作符

递增与递减（C语言）
对于非数值的数据类型会先转换为数值,再运算

一元加和减（数学中的正负号）
 */

/*
位操作符
 非（~） 与（&）  或（|） 异或（^） 左移（<<） 有符号的右移(>>)  无符号的右移(>>>)
 */

/*
布尔操作符
非（！） 与（&&） 或（||）
NaN为false
与或是短路操作
 */

/*
乘性操作符
乘法（*）、除法（/）、求模(求余)（%）
"先Number(),再计算"
Infinity*0=NaN

 Infinity/Infinity=NaN
 0/0=NaN

 Infinity%2=NaN
 Infinity%0=NaN
 Infinity%Infinity=NaN
 (有限)num %Infinity = num
 */
console.log(1/0);//>.<

/*
加性操作符

 Infinity+(-Infinity)=NaN
 +0+(-0)=+0
 */

/*
关系操作符
< > <= >=
大写的字符编码小于小写字符编码
如不为数值，先Number()
 */

/*
相等操作符
==、！=先转换在比较  ===、！==只比较不转换
保持代码数据类型的完整性  推荐使用全等和不全等
 */

/*
条件操作符（三元运算符）？
可嵌套
 */

/*
赋值操作符与符合赋值操作符（简化赋值操作，不会带来性能的提升）
 */

/*
逗号操作符
 */

















